{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":128,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense165831","trainable":true,"batch_input_shape":[null,20],"dtype":"float32"}},{"class_name":"Dense","config":{"units":256,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense165832","trainable":true,"batch_input_shape":[null,128],"dtype":"float32"}},{"class_name":"Dense","config":{"units":128,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense165833","trainable":true,"batch_input_shape":[null,256],"dtype":"float32"}},{"class_name":"Dense","config":{"units":64,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense165834","trainable":true,"batch_input_shape":[null,128],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense165835","trainable":true}}],"keras_version":"tfjs-layers 1.0.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.4","convertedBy":null,"weightsManifest":[{"paths":["./BestGuyBrain.weights.bin"],"weights":[{"name":"dense_Dense165831/kernel","shape":[20,128],"dtype":"float32"},{"name":"dense_Dense165831/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense165832/kernel","shape":[128,256],"dtype":"float32"},{"name":"dense_Dense165832/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense165833/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense165833/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense165834/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense165834/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense165835/kernel","shape":[64,4],"dtype":"float32"},{"name":"dense_Dense165835/bias","shape":[4],"dtype":"float32"}]}]}