{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10293","trainable":true,"batch_input_shape":[null,9],"dtype":"float32"}},{"class_name":"Dense","config":{"units":32,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10294","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"}},{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10295","trainable":true,"batch_input_shape":[null,32],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10296","trainable":true}}],"keras_version":"tfjs-layers 1.0.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.4","convertedBy":null,"weightsManifest":[{"paths":["./BestGuyBrain.weights.bin"],"weights":[{"name":"dense_Dense10293/kernel","shape":[9,16],"dtype":"float32"},{"name":"dense_Dense10293/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense10294/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense10294/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense10295/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense10295/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense10296/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense10296/bias","shape":[4],"dtype":"float32"}]}]}